Tekla.Structures.Model.TaskDependency.DependencyTypeEnum
The task dependency types.

Tekla.Structures.Model.TaskDependency.DependencyTypeEnum.FINISH_TO_FINISH
The task dependency type finish-to-finish.

Tekla.Structures.Model.TaskDependency.DependencyTypeEnum.FINISH_TO_START
The task dependency type finish-to-start.

Tekla.Structures.Model.TaskDependency.DependencyTypeEnum.START_TO_FINISH
The task dependency type start-to-finish.

Tekla.Structures.Model.TaskDependency.DependencyTypeEnum.START_TO_START
The task dependency type start-to-start.